# Gestión de Datos

In [3]:
%ls

00_00_binder.ipynb                    02_02_basic_math.ipynb
00_00_primer_pasos.ipynb              Clase_2.ipynb
01_01_data_types.ipynb                datasets/
01_02_read_iloc_unique_groupby.ipynb  README.md
02_00_data_wrangling.ipynb            requirements.txt
02_01_null_display.ipynb              Untitled.ipynb

In [5]:
import pandas as pd

In [1]:
%ls datasets/

adult.csv                  census.csv     movies.csv
airline_data.csv           coches.csv     nhanes_2015_2016.csv
antropometria00.csv        cwurData.csv   pokemon.csv
antropometria-dataset.csv  data.csv       sample_pivot.csv
Book3.csv                  headbrain.csv  tips.csv
Canada.xlsx                mic2.xlsx      weight-height.csv
Cartwheeldata.csv          mic.xlsx

In [8]:
path = 'datasets/Cartwheeldata.csv'
dataFrame = pd.read_csv(path)
dataFrame.head(2)

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8

In [14]:
x = dataFrame.columns

In [11]:
type(dataFrame)

pandas.core.frame.DataFrame

In [15]:
type(x)

pandas.core.indexes.base.Index

In [16]:
x = list(dataFrame.columns)
y = x.sort()
x

['Age',
 'CWDistance',
 'Complete',
 'CompleteGroup',
 'Gender',
 'GenderGroup',
 'Glasses',
 'GlassesGroup',
 'Height',
 'ID',
 'Score',
 'Wingspan']

# Variables de interés

In [18]:
dataFrame.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

In [19]:
dataFrame['Age']

0     56
1     26
2     33
3     39
4     27
5     24
6     28
7     22
8     29
9     33
10    30
11    28
12    25
13    23
14    31
15    26
16    26
17    27
18    23
19    24
20    23
21    29
22    25
23    26
24    23
Name: Age, dtype: int64

In [20]:
dataFrame[['Age','Height']]

    Age  Height
0    56   62.00
1    26   62.00
2    33   66.00
3    39   64.00
4    27   73.00
5    24   75.00
6    28   75.00
7    22   65.00
8    29   74.00
9    33   63.00
10   30   69.50
11   28   62.75
12   25   65.00
13   23   61.50
14   31   73.00
15   26   71.00
16   26   61.50
17   27   66.00
18   23   70.00
19   24   68.00
20   23   69.00
21   29   71.00
22   25   70.00
23   26   69.00
24   23   65.00

In [24]:
x = dataFrame['Age'].head(2)
x

0    56
1    26
Name: Age, dtype: int64

In [28]:
z= dataFrame[['Age','Height','CWDistance']].head(2)
z

   Age  Height  CWDistance
0   56    62.0          79
1   26    62.0          70

In [25]:
type(x)

pandas.core.series.Series

In [26]:
y = dataFrame[['Age']].head(2)
y

   Age
0   56
1   26

In [27]:
type(y)

pandas.core.frame.DataFrame

In [29]:
type(z)

pandas.core.frame.DataFrame

In [31]:
dataFrame[['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses']].head(2)

   ID  Age Gender  GenderGroup Glasses
0   1   56      F            1       Y
1   2   26      F            1       Y

In [33]:
### sintaxis de loc
### [ row_initial:row_final, col_initial:col_final]

In [39]:
ndf = dataFrame.loc[3:10,:'Glasses']
ndf

    ID  Age Gender  GenderGroup Glasses
3    4   39      F            1       N
4    5   27      M            2       N
5    6   24      M            2       N
6    7   28      M            2       N
7    8   22      F            1       N
8    9   29      M            2       Y
9   10   33      F            1       Y
10  11   30      M            2       Y

In [ ]:
###sintaxis de iloc
### indices de renglones y las columnas

In [40]:
ndf = dataFrame.iloc[3:10,:5]
ndf

   ID  Age Gender  GenderGroup Glasses
3   4   39      F            1       N
4   5   27      M            2       N
5   6   24      M            2       N
6   7   28      M            2       N
7   8   22      F            1       N
8   9   29      M            2       Y
9  10   33      F            1       Y